from os import listdir

STATEMENTS_DIRECTORY = './statements'
REQUESTS_DIRECTORY = './requests'
GRADE_REPORTS_DIRECTORY = './grade_reports'
STATISTIC_DIRECTORY = './statistic'
EXAM_RESULTS_DIRECTORY = './exam_results'

GRADE_REPORTS_DIR = '/home/hinahin/PycharmProjects/Pandas_grade_analyse/grade_reports/'
EXAM_RESULTS_DIR = '/home/hinahin/PycharmProjects/Pandas_grade_analyse/exam_results/'
DEFAULT_DOWNLOAD_DIR = '/home/hinahin/'

REQUESTS_FILES = listdir(REQUESTS_DIRECTORY)

USERNAME = ''
PASSWORD = ''

archc = {"Тестирование (Avg)": 0.006,
         "Итоговый контроль (Avg)": 0.004,
         "Grade": 0.01,
         "Columns_for_order": ["Тесты (проходной балл 40)",
                               "Экзамен (проходной балл 40)",
                               "Итоговый балл"],
         "Columns_for_report": ["Email",
                                "Тестирование (Avg)",
                                "Итоговый контроль (Avg)",
                                "Grade"]
         }

bioeco = {"Учебное задание (Avg)": 0.002,
          "Промежуточное задание (Avg)": 0.004,
          "Итоговый контроль (Avg)": 0.004,
          "Grade": 0.01,
          "Columns_for_order": ["Учебные задания (проходной балл 40)",
                                "Промежуточные задания (проходной балл 40)",
                                "Экзамен (проходной балл 40)",
                                "Итоговый балл"],
          "Columns_for_report": ["Email",
                                 "Учебное задание (Avg)",
                                 "Промежуточное задание (Avg)",
                                 "Итоговый контроль (Avg)",
                                 "Grade"]
          }

calc = {"Тест (Avg)": 0.001,
        "Рубежный тест (Avg)": 0.005,
        "Итоговый контроль (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Тесты (проходной балл 40)",
                              "Рубежные тесты (проходной балл 40)",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Тест (Avg)",
                               "Рубежный тест (Avg)",
                               "Итоговый контроль (Avg)",
                               "Grade"]
        }

cellbio = {"Учебное задание (Avg)": 0.001,
           "Контрольное задание (Avg)": 0.003,
           "Промежуточный контроль (Avg)": 0.002,
           "Final Exam (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Учебные задания (проходной балл 40)",
                                 "Контрольные задания (проходной балл 40)",
                                 "Промежуточный контроль (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Учебное задание (Avg)",
                                  "Контрольное задание (Avg)",
                                  "Промежуточный контроль (Avg)",
                                  "Final Exam (Avg)",
                                  "Grade"]
           }

chemso = {"Задание (Avg)": 0.006,
          "Итоговый контроль (Avg)": 0.004,
          "Grade": 0.01,
          "Columns_for_order": ["Задания (проходной балл 40)",
                                "Итоговый контроль (прокторинг)",
                                "Экзамен (проходной балл 40)",
                                "Итоговый балл"],
          "Columns_for_report": ["Email",
                                 "Задание (Avg)",
                                 "Итоговый контроль (Avg)",
                                 "Grade"]
          }

chryso = {"Учебные задания (Avg)": 0.0015,  # Не настроен итоговый контроль
          "Контрольные задания (Avg)": 0.0025,
          "Промежуточный контроль (Avg)": 0.002,
          "Grade": 0.01,
          "Columns_for_order": ["Учебные задания (проходной балл 40)",
                                "Контрольные задания (проходной балл 40)",
                                "Промежуточный контроль (проходной балл 40)",
                                "Итоговый балл"],
          "Columns_for_report": ["Email",
                                 "Учебные задания (Avg)",
                                 "Контрольные задания (Avg)",
                                 "Промежуточный контроль (Avg)",
                                 "Grade"]
          }

crithink = {"Тесты (Avg)": 0.0015,
            "Кейсы (Avg)": 0.0015,
            "Взаимопроверка": 0.001,
            "Задания по разделу (Avg)": 0.002,
            "Итоговый контроль (Avg)": 0.004,
            "Grade": 0.01,
            "Columns_for_order": ["Тесты (проходной балл 40)",
                                  "Кейсы (проходной балл 40)",
                                  "Взаимопроверка",
                                  "Задания по разделу (проходной балл 40)",
                                  "Экзамен (проходной балл 40)",
                                  "Итоговый балл"],
            "Columns_for_report": ["Email",
                                   "Тесты (Avg)",
                                   "Кейсы (Avg)",
                                   "Взаимопроверка",
                                   "Задания по разделу (Avg)",
                                   "Итоговый контроль (Avg)",
                                   "Grade"]
            }

csharp = {"Упражнения (Avg)": 0.002,
          "Практика (Avg)": 0.004,
          "Итоговый контроль (Avg)": 0.004,
          "Grade": 0.01,
          "Columns_for_order": ["Упражнения (проходной балл 40)",
                                "Практики (проходной балл 40)",
                                "Экзамен (проходной балл 40)",
                                "Итоговый балл"],
          "Columns_for_report": ["Email",
                                 "Упражнения (Avg)",
                                 "Практика (Avg)",
                                 "Итоговый контроль (Avg)",
                                 "Grade"]
          }

datainf = {"Практика (Avg)": 0.006,
           "Итоговый контроль (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Практика (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Практика (Avg)",
                                  "Итоговый контроль (Avg)",
                                  "Grade"]
           }

designbasics = {"Тестовое задание (Avg)": 0.003,
                "Практическое задание (Avg)": 0.003,
                "Итоговый контроль (Avg)": 0.004,
                "Grade": 0.01,
                "Columns_for_order": ["Тесты (проходной балл 40)",
                                      "Практики (проходной балл 40)",
                                      "Экзамен (проходной балл 40)",
                                      "Итоговый балл"],
                "Columns_for_report": ["Email",
                                       "Тестовое задание (Avg)",
                                       "Практическое задание (Avg)",
                                       "Итоговый контроль (Avg)",
                                       "Grade"]
                }

ecoeff = {"Тестирование (Avg)": 0.002,
          "Учебное задание (Avg)": 0.0015,
          "Контрольные задания (Avg)": 0.0025,
          "Итоговое тестирование (Avg)": 0.004,
          "Grade": 0.01,
          "Columns_for_order": ["Тесты (проходной балл 40)",
                                "Учебные задания (проходной балл 40)",
                                "Контрольные задания (проходной балл 40)",
                                "Экзамен (проходной балл 40)",
                                "Итоговый балл"],
          "Columns_for_report": ["Email",
                                 "Тестирование (Avg)",
                                 "Учебное задание (Avg)",
                                 "Контрольные задания (Avg)",
                                 "Итоговое тестирование (Avg)",
                                 "Grade"]
          }

ecos = {"Задание (Avg)": 0.0015,
        "Практическое задание (Avg)": 0.004,
        "Эссе": 0.0005,
        "Итоговое тестирование (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Задания (проходной балл 40)",
                              "Практические задания (проходной балл 40)",
                              "Эссе",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Задание (Avg)",
                               "Практическое задание (Avg)",
                               "Эссе",
                               "Итоговое тестирование (Avg)",
                               "Grade"]
        }

edubase = {"Контрольное задание (Avg)": 0.003,
           "Промежуточная аттестация (Avg)": 0.003,
           "Final Exam (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Контрольные задания (проходной балл 40)",
                                 "Промежуточная аттестация (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Контрольное задание (Avg)",
                                  "Промежуточная аттестация (Avg)",
                                  "Final Exam (Avg)",
                                  "Grade"]
           }

effsolution = {"Учебное задание (Avg)": 0.0015,
               "Тестирование (Avg)": 0.001,
               "Контрольное задание (Avg)": 0.0045,
               "Итоговое тестирование (Avg)": 0.003,
               "Grade": 0.01,
               "Columns_for_order": ["Учебное задание(проходной балл 40)",
                                     "Тестирование(проходной балл 40)",
                                     "Контрольные задания (проходной балл 40)",
                                     "Экзамен (проходной балл 40)",
                                     "Итоговый балл"],
               "Columns_for_report": ["Email",
                                      "Учебное задание (Avg)",
                                      "Тестирование (Avg))",
                                      "Контрольное задание (Avg)",
                                      "Итоговое тестирование (Avg)",
                                      "Grade"]
               }

elb = {"Домашная работа (Avg)": 0.006,
       "Итоговое задание (Avg)": 0.004,
       "Grade": 0.01,
       "Columns_for_order": ["Домашняя работа (проходной балл 40)",
                             "Экзамен (проходной балл 40)",
                             "Итоговый балл"],
       "Columns_for_report": ["Email",
                              "Домашная работа (Avg)",
                              "Итоговое задание (Avg)",
                              "Grade"]
       }


elecd = {"Домашние задания1 (Avg)": 0.004,
         "Домашние задания2 (Avg)": 0.002,
         "Итоговый контроль (Avg)": 0.004,
         "Grade": 0.01,
         "Columns_for_order": ["Домашние задания 1 (проходной балл 40)",
                               "Домашние задания 2 (проходной балл 40)",
                               "Экзамен (проходной балл 40)",
                               "Итоговый балл"],
         "Columns_for_report": ["Email",
                                "Домашние задания1 (Avg)",
                                "Домашние задания2 (Avg)",
                                "Итоговый контроль (Avg)",
                                "Grade"]
         }

engforinclusb = {"Homework (Avg)": 0.0015,  # не настроен!!!
                 "Lab (Avg)": 0.0015,
                 "Midterm Exam (Avg)": 0.004,
                 "Final Exam (Avg)": 0.003,
                 "Grade": 0.01,
                 "Columns_for_order": ["Homework (проходной балл 40)",
                                       "Lab (проходной балл 40)",
                                       "Midterm Exam (проходной балл 40)",
                                       "Final Exam (проходной балл 40)",
                                       "Итоговый балл"],
                 "Columns_for_report": ["Email",
                                        "Homework (Avg)",
                                        "Lab (Avg)",
                                        "Midterm Exam (Avg)",
                                        "Final Exam (Avg)",
                                        "Grade"]
                 }


engm = {"Тест (Avg)": 0.0015,
        "Домашнее задание (Avg)": 0.0030,
        "Базовый проект (Avg)": 0.0015,
        "Итоговый  тест (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Тесты (проходной балл 40)",
                              "Домашние задания (проходной балл 40)",
                              "Базовый проект (проходной балл 40)",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Тест (Avg)",
                               "Домашнее задание (Avg)",
                               "Базовый проект (Avg)",
                               "Итоговый  тест (Avg)",
                               "Grade"]
        }


filosofbase = {"Учебное задание (Avg)": 0.01,
               "Контрольное задание (Avg)": 0.01,
               "Итоговое тестирование": 0.01,
               "Grade": 0.01,
               "Columns_for_order": ["Учебное задание (проходной балл 40)",
                                     "Контрольное задание (проходной балл 40)",
                                     "Экзамен (проходной балл 40)",
                                     "Итоговый балл"],
               "Columns_for_report": ["Email",
                                      "Учебное задание (Avg)",
                                      "Контрольное задание (Avg)",
                                      "Итоговое тестирование",
                                      "Grade"]
               }


geom = {"Начертательная геометрия (Avg)": 0.003,
        "Инженерная графика (Avg)": 0.003,
        "Итоговый контроль (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Начертательная геометрия (проходной балл 40)",
                              "Инженерная графика (проходной балл 40)",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Начертательная геометрия (Avg)",
                               "Инженерная графика (Avg)",
                               "Итоговый контроль (Avg)",
                               "Grade"]
        }

govbusiness = {"Тест самоконтроля (Avg)": 0.0005,   # доработать после добавления Итогового контроля
               "Учебное задание (Avg)": 0.0015,
               "Контрольное задание (Avg)": 0.002,
               "Промежуточный контроль": 0.002,
               "Grade": 0.01,
               "Columns_for_order": ["Тест (проходной балл 40)",
                                     "Учебные задания (проходной балл 40)",
                                     "Контрольные задания (проходной балл 40)",
                                     "Контрольные задания (проходной балл 40)",
                                     "Итоговый балл"],
               "Columns_for_report": ["Email",
                                      "Тест самоконтроля (Avg)",
                                      "Учебное задание (Avg)",
                                      "Контрольное задание (Avg)",
                                      "Промежуточный контроль",
                                      "Grade"]
               }

hist_view = {"Test (Avg)": 0.003,
             "modul (Avg)": 0.003,
             "Final Exam (Avg)": 0.004,
             "Grade": 0.01,
             "Columns_for_order": ["Тесты (проходной балл 40)",
                                   "Модули (проходной балл 40)",
                                   "Экзамен (проходной балл 40)",
                                   "Итоговый балл"],
             "Columns_for_report": ["Email",
                                    "Test (Avg)",
                                    "modul (Avg)",
                                    "Final Exam (Avg)",
                                    "Grade"]
             }

hist = {"Тестовое задание (Avg)": 0.003,
        "Учебное задание (Avg)": 0.003,
        "Итоговый контроль (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Тесты (проходной балл 40)",
                              "Учебные задания (проходной балл 40)",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Тестовое задание (Avg)",
                               "Учебное задание (Avg)",
                               "Итоговый контроль (Avg)",
                               "Grade"]
        }

inclus_m1 = {"Тестирование к разделу (Avg)": 0.002,
             "Задание к разделу (Avg)": 0.004,
             "Итоговое тестирование (Avg)": 0.004,
             "Grade": 0.01,
             "Columns_for_order": ["Тесты (проходной балл 40)",
                                   "Задания (проходной балл 40)",
                                   "Экзамен (проходной балл 40)",
                                   "Итоговый балл"],
             "Columns_for_report": ["Email",
                                    "Тестирование к разделу (Avg)",
                                    "Задание к разделу (Avg)",
                                    "Итоговое тестирование (Avg)",
                                    "Grade"]
             }


inclus_m2 = {"Тестирование к разделу (Avg)": 0.002,
             "Задание к разделу (Avg)": 0.004,
             "Итоговое тестирование (Avg)": 0.004,
             "Grade": 0.01,
             "Columns_for_order": ["Тесты (проходной балл 40)",
                                   "Задания (проходной балл 40)",
                                   "Экзамен (проходной балл 40)",
                                   "Итоговый балл"],
             "Columns_for_report": ["Email",
                                    "Тестирование к разделу (Avg)",
                                    "Задание к разделу (Avg)",
                                    "Итоговое тестирование (Avg)",
                                    "Grade"]
             }

infeng = {"Учебное задание (Avg)": 0.006,
          "Итоговый контроль (Avg)": 0.004,
          "Grade": 0.01,
          "Columns_for_order": ["Учебное задание (проходной балл 40)",
                                "Экзамен (проходной балл 40)",
                                "Итоговый балл"],
          "Columns_for_report": ["Email",
                                 "Учебное задание (Avg)",
                                 "Итоговый контроль (Avg)",
                                 "Grade"]
          }

intpr = {"Тест (Avg)": 0.003,
         "Учебные задания (Avg)": 0.003,
         "Final Exam (Avg)": 0.004,
         "Grade": 0.01,
         "Columns_for_order": ["Тесты (проходной балл 40)",
                               "Учебные задания (проходной балл 40)",
                               "Экзамен (проходной балл 40)",
                               "Итоговый балл"],
         "Columns_for_report": ["Email",
                                "Тест (Avg)",
                                "Учебные задания (Avg)",
                                "Final Exam (Avg)",
                                "Grade"]
         }

introbe = {"Тестовое задание (Avg)": 0.0015,
           "Промежуточный контроль (Avg)": 0.003,
           "Учебное задание (Avg)": 0.0015,
           "Итоговый контроль (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Тесты (проходной балл 40)",
                                 "Промежуточный контроль (проходной балл 40)",
                                 "Учебные задания (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Тестовое задание (Avg)",
                                  "Промежуточный контроль (Avg)",
                                  "Учебное задание (Avg)",
                                  "Итоговый контроль (Avg)",
                                  "Grade"]
           }

its = {"Тестовые задания (Avg)": 0.006,  # Требует доработки после добавления экзамена
       "Grade": 0.01,
       "Columns_for_order": ["Тесты (проходной балл 40)",
                             "Итоговый балл"],
       "Columns_for_report": ["Email",
                              "Тестовые задания (Avg)",
                              "Grade"]
       }


legal = {"Тест по разделу (Avg)": 0.008,
         "Final Exam (Avg)": 0.002,
         "Grade": 0.01,
         "Columns_for_order": ["Тесты (проходной балл 40)",
                               "Экзамен (проходной балл 40)",
                               "Итоговый балл"],
         "Columns_for_report": ["Email",
                                "Тест по разделу (Avg)",
                                "Final Exam (Avg)",
                                "Grade"]
         }

lifesafety = {"Тестовое задание (Avg)": 0.003,
              "Практическое задание (Avg)": 0.003,
              "Итоговый контроль (Avg)": 0.004,
              "Grade": 0.01,
              "Columns_for_order": ["Тесты (проходной балл 40)",
                                    "Практическое задание (проходной балл 40)",
                                    "Экзамен (проходной балл 40)",
                                    "Итоговый балл"],
              "Columns_for_report": ["Email",
                                     "Тестовое задание (Avg)",
                                     "Практическое задание (Avg)",
                                     "Итоговый контроль (Avg)",
                                     "Grade"]
              }

linealg = {"Тестовое задание (Avg)": 0.003,          # требует доработки после добавления Итогового контроля
           "Промежуточный контроль (Avg)": 0.0032,     # обновить после доработки
           "Итоговый контроль": 0.01,
           "Grade": 0.01,
           "Columns_for_order": ["Тестовое задание (проходной балл 40)",
                                 "Промежуточный контроль (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Тестовое задание (Avg)",
                                  "Промежуточный контроль (Avg)",
                                  "Итоговый контроль",
                                  "Grade"]
           }

manegemach = {"Тестовое задание (Avg)": 0.0015,
              "Учебное задание (Avg)": 0.0015,
              "Контрольное задание (Avg)": 0.0030,
              "Итоговое тестирование (Avg)": 0.004,
              "Grade": 0.01,
              "Columns_for_order": ["Тестовые задания (проходной балл 40)",
                                    "Учебные задания (проходной балл 40)",
                                    "Контрольные задания (проходной балл 40)",
                                    "Экзамен (проходной балл 40)",
                                    "Итоговый балл"],
              "Columns_for_report": ["Email",
                                     "Тестовое задание (Avg)",
                                     "Учебное задание (Avg)",
                                     "Контрольное задание (Avg)",
                                     "Итоговое тестирование (Avg)",
                                     "Grade"]
              }

mcs = {"Тестовое задание (Avg)": 0.0015,
       "Учебное задание (Avg)": 0.0015,
       "Контрольные задания (Avg)": 0.003,
       "Итоговый контроль (Avg)": 0.004,
       "Grade": 0.01,
       "Columns_for_order": ["Тесты (проходной балл 40)",
                             "Учебные задания (проходной балл 40)",
                             "Контрольные задания (проходной балл 40)",
                             "Экзамен (проходной балл 40)",
                             "Итоговый балл"],
       "Columns_for_report": ["Email",
                              "Тестовое задание (Avg)",
                              "Учебное задание (Avg)",
                              "Контрольные задания (Avg)",
                              "Итоговый контроль (Avg)",
                              "Grade"]
       }

methods = {"Задание (Avg)": 0.006,
           "Итоговый контроль (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Задание (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Задание (Avg) (Avg)",
                                  "Итоговый контроль (Avg)",
                                  "Grade"]
           }

metr = {"Метрология (Avg)": 0.002,
        "Стандартизация (Avg)": 0.002,
        "Оценка соответствия (Avg)": 0.002,
        "Итоговый контроль (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Метрология (проходной балл 40)",
                              "Стандартизация (проходной балл 40)",
                              "Оценка соответствия (проходной балл 40)",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Метрология (Avg)",
                               "Стандартизация (Avg)",
                               "Оценка соответствия (Avg)",
                               "Итоговый контроль (Avg)",
                               "Grade"]
        }

nucmed = {"Контрольное заданние (Avg)": 0.004,
          "Учебное задание (Avg)": 0.002,
          "Final Exam (Avg)": 0.004,
          "Grade": 0.01,
          "Columns_for_order": ["Контрольные задания (проходной балл 40)",
                                "Учебные задания (проходной балл 40)",
                                "Экзамен (проходной балл 40)",
                                "Итоговый балл"],
          "Columns_for_report": ["Email",
                                 "Контрольное заданние (Avg)",
                                 "Учебное задание (Avg)",
                                 "Final Exam (Avg)",
                                 "Grade"]
          }

natcult = {"Контрольное заданние (Avg)": 0.004,  # требует доработки
           "Учебное задание (Avg)": 0.002,
           "Final Exam (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Контрольные задания (проходной балл 40)",
                                 "Учебные задания (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Контрольное заданние (Avg)",
                                  "Учебное задание (Avg)",
                                  "Final Exam (Avg)",
                                  "Grade"]
           }

personalsafety = {"Тестирование к теме (Avg)": 0.0032,
                  "Интерактивное задание (Avg)": 0.0028,
                  "Итоговое тестирование (Avg)": 0.004,
                  "Grade": 0.01,
                  "Columns_for_order": ["Тесты (проходной балл 40)",
                                        "Интерактивные задания (проходной балл 40)",
                                        "Экзамен (проходной балл 40)",
                                        "Итоговый балл"],
                  "Columns_for_report": ["Email",
                                         "Тестирование к теме (Avg)",
                                         "Интерактивное задание (Avg)",
                                         "Итоговое тестирование (Avg)",
                                         "Grade"]
                  }

philosophy = {"Тест (Avg)": 0.002,
              "Учебное задание (Avg)": 0.002,
              "Контрольное задание (Avg)": 0.003,
              "Итоговый контроль (Avg)": 0.003,
              "Grade": 0.01,
              "Columns_for_order": ["Тесты (проходной балл 40)",
                                    "Учебные задания (проходной балл 40)",
                                    "Контрольные задания (проходной балл 40)",
                                    "Экзамен (проходной балл 40)",
                                    "Итоговый балл"],
              "Columns_for_report": ["Email",
                                     "Тест (Avg)",
                                     "Учебное задание (Avg)",
                                     "Контрольное задание (Avg)",
                                     "Итоговый контроль (Avg)",
                                     "Grade"]
              }

phils = {"Тест (Avg)": 0.002,
         "Учебное задание (Avg)": 0.003,
         "Итоговый контроль (Avg)": 0.005,
         "Grade": 0.01,
         "Columns_for_order": ["Тесты (проходной балл 40)",
                               "Учебные задания (проходной балл 40)",
                               "Экзамен (проходной балл 40)",
                               "Итоговый балл"],
         "Columns_for_report": ["Email",
                                "Тест (Avg)",
                                "Учебное задание (Avg)",
                                "Итоговый контроль (Avg)",
                                "Grade"]
         }

philsci = {"Тестовое задание (Avg)": 0.0025,
           "Учебное задание (Avg)": 0.0025,
           "Промежуточная аттестация (Avg)": 0.001,
           "Итоговый контроль (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Тесты (проходной балл 40)",
                                 "Учебные задания (проходной балл 40)",
                                 "Промежуточная аттестация",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Тестовое задание (Avg)",
                                  "Учебное задание (Avg)",
                                  "Промежуточная аттестация (Avg)",
                                  "Итоговый контроль (Avg)",
                                  "Grade"]
           }


physcult = {"Тест самоконтроля (Avg)": 0.0005,  # не настроен итоговый контроль
            "Учебные задания (Avg)": 0.0015,
            "Контрольные задания (Avg)": 0.0015,
            "Промежуточный контроль (Avg)": 0.0025,
            "Итоговый контроль (Avg)": 0.004,
            "Grade": 0.01,
            "Columns_for_order": ["Тесты (проходной балл 40)",
                                  "Учебные задания (проходной балл 40)",
                                  "Контрольные задания (проходной балл 40)",
                                  "Промежуточный контроль (проходной балл 40)",
                                  "Экзамен (проходной балл 40)",
                                  "Итоговый балл"],
            "Columns_for_report": ["Email",
                                   "Тест самоконтроля (Avg)",
                                   "Учебные задания (Avg)",
                                   "Контрольные задания (Avg)",
                                   "Промежуточный контроль (Avg)",
                                   "Итоговый контроль (Avg)",
                                   "Grade"]
            }

prgrmm = {"Упражнения (Avg)": 0.002,
          "Практика (Avg)": 0.004,
          "Final Exam (Avg)": 0.004,
          "Grade": 0.01,
          "Columns_for_order": ["Упражнения (проходной балл 40)",
                                "Практики (проходной балл 40)",
                                "Экзамен (проходной балл 40)",
                                "Итоговый балл"],
          "Columns_for_report": ["Email",
                                 "Упражнения (Avg)",
                                 "Практика (Avg)",
                                 "Final Exam (Avg)",
                                 "Grade"]
          }

proj = {"Тест (Avg)": 0.0015,
        "Учебное задание (Avg)": 0.0015,
        "Контрольное задание (Avg)": 0.003,
        "Итоговый контроль (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Тест (проходной балл 40)",
                              "Учебное задание (проходной балл 40)",
                              "Контрольное задание (проходной балл 40)",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Тест (Avg)",
                               "Учебное задание (Avg)",
                               "Контрольное задание (Avg)",
                               "Итоговый контроль (Avg)",
                               "Grade"]
        }

psymedia = {"Кроссворд (Avg)": 0.002,
            "Контрольное задание (Avg)": 0.003,
            "Учебное задание (Avg)": 0.001,
            "Итоговое тестирование (Avg)": 0.004,
            "Grade": 0.01,
            "Columns_for_order": ["Кроссворды (проходной балл 40)",
                                  "Контрольные задания (проходной балл 40)",
                                  "Учебные задания (проходной балл 40)",
                                  "Экзамен (проходной балл 40)",
                                  "Итоговый балл"],
            "Columns_for_report": ["Email",
                                   "Кроссворд (Avg)",
                                   "Контрольное задание (Avg)",
                                   "Учебное задание (Avg)",
                                   "Итоговое тестирование (Avg)",
                                   "Grade"]
            }

pydnn = {"Учебное задание (Avg)": 0.002,  # не настроен Итоговый контроль
         "Контрольное задание (Avg)": 0.002,
         "Рубежный контроль (Avg)": 0.002,
         "Grade": 0.01,
         "Columns_for_order": ["Учебное задание (проходной балл 40)",
                               "Контрольное задание (проходной балл 40)",
                               "Рубежный контроль (проходной балл 40)",
                               "Итоговый балл"],
         "Columns_for_report": ["Email",
                                "Учебное задание (Avg)",
                                "Контрольное задание (Avg)",
                                "Рубежный контроль (Avg)",
                                "Grade"]
         }

pyap = {"Тесты самоконтроля (Avg)": 0.002,  # Не настроен
        "Учебные задания (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Тесты самоконтроля (проходной балл 40)",
                              "Учебные задания (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Тесты самоконтроля (Avg)",
                               "Учебные задания (Avg)",
                               "Grade"]
        }

rubscult = {"Тестовые задания (Avg)": 0.002,
            "Учебные задания (Avg)": 0.002,
            "Контрольные задания (Avg)": 0.002,
            "Итоговый контроль (Avg)": 0.004,
            "Grade": 0.01,
            "Columns_for_order": ["Тесты (проходной балл 40)",
                                  "Учебные задания (проходной балл 40)",
                                  "Контрольные задания (проходной балл 40)",
                                  "Экзамен (проходной балл 40)",
                                  "Итоговый балл"],
            "Columns_for_report": ["Email",
                                   "Тестовые задания (Avg)",
                                   "Учебные задания (Avg)",
                                   "Контрольные задания (Avg)",
                                   "Итоговый контроль (Avg)",
                                   "Grade"]
            }

sigproc = {"Тесты (Avg)": 0.006,
           "Итоговый контроль (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Тесты (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Тесты (Avg)",
                                  "Итоговый контроль (Avg)",
                                  "Grade"]
           }

smngm = {"Учебное задание (Avg)": 0.006,
         "Итоговый контроль (Avg)": 0.004,
         "Grade": 0.01,
         "Columns_for_order": ["Учебные задания (проходной балл 40)",
                               "Экзамен (проходной балл 40)",
                               "Итоговый балл"],
         "Columns_for_report": ["Email",
                                "Учебное задание (Avg)",
                                "Итоговый контроль (Avg)",
                                "Grade"]
         }

softskills = {"Homework (Avg)": 0.006,  # доработать
              "Lab (Avg)": 0.004,
              "Grade": 0.01,
              "Columns_for_order": ["Домашние задания (проходной балл 40)",
                                    "Учебные задания (проходной балл 40)",
                                    "Итоговый балл"],
              "Columns_for_report": ["Email",
                                     "Homework (Avg)",
                                     "Lab (Avg)",
                                     "Grade"]
              }

systeng = {"Задания (Avg)": 0.002,
           "Практика (Avg)": 0.004,
           "Итоговый контроль (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Задания (проходной балл 40)",
                                 "Практики (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Задания (Avg)",
                                  "Практика (Avg)",
                                  "Итоговый контроль (Avg)",
                                  "Grade"]
           }

teco = {"Тест для самоконтроля (Avg)": 0.003,
        "Задание (Avg)": 0.003,
        "Итоговое тестирование (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Тесты (проходной балл 40)",
                              "Задания (проходной балл 40)",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Тест для самоконтроля (Avg)",
                               "Задание (Avg)",
                               "Итоговое тестирование (Avg)",
                               "Grade"]
        }

telecom = {"Тестовое задание (Avg)": 0.006,
           "Final Exam (Avg)": 0.004,
           "Grade": 0.01,
           "Columns_for_order": ["Тесты (проходной балл 40)",
                                 "Экзамен (проходной балл 40)",
                                 "Итоговый балл"],
           "Columns_for_report": ["Email",
                                  "Тестовое задание (Avg)",
                                  "Final Exam (Avg)",
                                  "Grade"]
           }

tepl = {"Техническая термодинамика (Avg)": 0.002,
        "Теплообмен (Avg)": 0.002,
        "Энергетическое оборудование (Avg)": 0.002,
        "Итоговый контроль (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Техническая термодинамика (проходной балл 40)",
                              "Теплообмен (проходной балл 40)",
                              "Энергетическое оборудование (проходной балл 40)",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Техническая термодинамика (Avg)",
                               "Теплообмен (Avg)",
                               "Энергетическое оборудование (Avg)",
                               "Итоговый контроль (Avg)",
                               "Grade"]
        }

theorver = {"Учебные задания (Avg)": 0.001,     # донастроить экзамен, когда он появится
            "Контрольные задания (Avg)": 0.0025,
            "Промежуточный контроль (Avg)": 0.0025,
            "Grade": 0.01,
            "Columns_for_order": ["Учебное задание (проходной балл 40)",
                                  "Контрольные задания (проходной балл 40)",
                                  "Промежуточный контроль (проходной балл 40)",
                                  "Итоговый балл"],
            "Columns_for_report": ["Email",
                                   "Учебные задания (Avg)",
                                   "Контрольные задания (Avg)",
                                   "Промежуточный контроль (Avg)",
                                   "Grade"]
            }

triz = {"Homework (Avg)": 0.005,
        "Midterm Exam": 0.001,
        "Final Exam (Avg)": 0.004,
        "Grade": 0.01,
        "Columns_for_order": ["Домашняя работа (проходной балл 40)",
                              "Эссе",
                              "Экзамен (проходной балл 40)",
                              "Итоговый балл"],
        "Columns_for_report": ["Email",
                               "Homework (Avg)",
                               "Midterm Exam",
                               "Final Exam (Avg)",
                               "Grade"]
        }


courses = {'archc': archc,  # Основы архитектуры и строительных конструкций
           'bioeco': bioeco,  # Основные концепции биологии и экологии
           'calc': calc,  # Математический анализ
           'cellbio': cellbio,  # Введение в биологию клетки
           'chemso': chemso,  # Аккумуляторы, топливные элементы и их роль в современном мире
           'chryso': chryso,  # Строительные технологии на основе хризотилцементных материалов
           'crithink': crithink,  # Основы критического мышления
           'csharp': csharp,  # Программирование на C#
           'datainf': datainf,  # Методы доступа к данным и информационного поиска
           'designbasics': designbasics,  # Основы дизайна
           'ecoeff': ecoeff,  # Основы экономической эффективности производства
           'ecos': ecos,  # Системная динамика устойчивого развития (Системная экология)
           'edubase': edubase,  # Основы педагогической деятельности
           'effsolution': effsolution,  # Экономическая эффективность технических решений
           'elb': elb,  # Основы электротехники и электроники
           'elecd': elecd,  # Электродинамика
           'engforinclusb': engforinclusb,  # English
           'engm': engm,  # Инженерная механика
           'filosofbase': filosofbase,  # Философия (базовый курс)
           'geom': geom,  # Начертательная геометрия и инженерная графика
           'govbusiness': govbusiness,  # Взаимодействие государства и бизнеса в условиях цифровой трансформации
           'hist_view': hist_view,  # История: 5 подходов к историческому развитию
           'hist': hist,  # История
           'inclus_m1': inclus_m1,  # Основы личностного роста (для лиц с ОВЗ)
           'inclus_m2': inclus_m2,  # Развитие ресурсов организма (для лиц с ОВЗ)
           'infeng': infeng,  # Информационные сервисы в управлении инженерной деятельностью
           'intpr': intpr,  # Управление интеллектуальной собственностью
           'introbe': introbe,  # Введение в биологию и экологию
           'its': its,  # Информационные технологии и сервисы
           'legal': legal,  # Нормативно-правовое обеспечение онлайн-обучения
           'lifesafety': lifesafety,  # Безопасность жизнедеятельности
           'linealg': linealg,  # Основные приложения линейной алгебры в инженерном образовании
           'manegemach': manegemach,  # Управление машиностроительным предприятием
           'mcs': mcs,  # Естественнонаучная картина мира
           'methods': methods,  # Методы анализа и прогнозирования временных рядов
           'metr': metr,  # Основы метрологии, стандартизация и оценка соответствия
           'nucmed': nucmed,  # Ядерная медицина
           'natcult': natcult,  # Национальные культуры: коммуникация, модели управления, стили лидерства
           'personalsafety': personalsafety,  # Личная безопасность
           'philosophy': philosophy,  # Философия
           'phils': phils,  # Философия и история науки и техники
           'philsci': philsci,  # Философия и методология науки
           'physcult': physcult,  # Физическая культура
           'prgrmm': prgrmm,  # Технологии программирования
           'proj': proj,  # Основы проектной деятельности
           'psymedia': psymedia,  # Психология медиакоммуникаций цифровой эпохи
           'pydnn': pydnn,  # Программирование глубоких нейронных сетей на Python
           'pyap': pyap,  # Прикладное программирование на языке Python
           'rubscult': rubscult,  # Культура русской деловой речи
           'sigproc': sigproc,  # Основы цифровой обработки сигналов
           'smngm': smngm,  # Самоменеджмент
           'softskills': softskills,  # Soft Skills: навыки 21 века
           'systeng': systeng,  # Практики системной инженерии
           'teco': teco,  # Технология конструкционных материалов
           'telecom': telecom,  # Беспроводные телекоммуникационные системы
           'tepl': tepl,  # Теплотехника
           'theorver': theorver,    # Теория вероятностей и математическая статистика для инженеров
           'triz': triz,  # Теория решения изобретательских задач
           }

LIST_COURSES = ['ARCHC+fall_2020',
                'ARCHC+fall_2020_net',
                'BIOECO+fall_2020',
                'CALC+fall_2020',
                'CELLBIO+fall_2020',
                'CHEMSO+fall_2020',
                'chryso+fall_2020',
                'Crithink+fall_2020',
                'CSHARP+fall_2020',
                'CSHARP+fall_2020_net',
                'DATAINF+fall_2020',
                'DesignBasics+fall_2020',
                'DesignBasics+fall_2020_net',
                'ECOEFF+fall_2020',
                'ECOS+fall_2020',
                'EDUBASE+fall_2020',
                'EDUBASE+fall_2020_net',
                'EFFSOLUTION+fall_2020',
                'ELB+fall_2020',
                'ELB+fall_2020_net',
                'ELECD+fall_2020',
                'engforinclusb+fall_2020',
                'ENGM+fall_2020',
                'GEOM+fall_2020',
                'GEOM+fall_2020_net',
                'GOVBUSINESS+fall_2020',
                'HIST_VIEW+fall_2020',
                'HIST_VIEW+fall_2020_net',
                'HIST+fall_2020',
                'Inclus_M1+fall_2020',
                'Inclus_M2+fall_2020',
                'INFENG+fall_2020',
                'INTPR+fall_2020',
                'INTPR+fall_2020_net',
                'INTROBE+fall_2020',
                'ITS+fall_2020',
                'LEGAL+fall_2020',
                'LifeSafety+fall_2020',
                'LifeSafety+fall_2020_net',
                'LineAlg+fall_2020',
                'MANEGEMACH+fall_2020',
                'MCS+fall_2020',
                'METHODS+fall_2020',
                'METR+fall_2020',
                'METR+fall_2020_net',
                'NUCMED+fall_2020',
                'NATCULT+fall_2020',
                'PersonalSafety+fall_2020',
                'PHILOSOPHY+fall_2020',
                'PHILS+fall_2020',
                'PHILS+fall_2020_net',
                'PHILSCI+fall_2020',
                'PHILSCI+fall_2020_net',
                'PhysCult+fall_2020',
                'PRGRMM+fall_2020',
                'PRGRMM+fall_2020_net',
                'PROJ+fall_2020',
                'PSYMEDIA+fall_2020',
                'PSYMEDIA+fall_2020_net',
                'PYDNN+fall_2020',
                'PYAP+fall_2020',
                'RUBSCULT+fall_2020',
                'RUBSCULT+fall_2020_net',
                'SIGPROC+fall_2020',
                'SMNGM+fall_2020',
                'SMNGM+fall_2020_net',
                'SoftSkills+fall_2020',
                'SYSTENG+fall_2020',
                'SYSTENG+fall_2020_net',
                'TECO+fall_2020',
                'TECO+fall_2020_net',
                'TELECOM+fall_2020',
                'TELECOM+fall_2020_net',
                'TEPL+fall_2020',
                'TheorVer+fall_2020',
                'TRIZ+fall_2020',
                ]
